## IMPORTING THE LIBRARIES

In [1]:
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt

## READING THE FILES

In [2]:
master_data=pd.read_excel("C:/New folder/Credit Card Data.xlsx")

In [3]:
master_data.head()

   No Customer  Age       City   Product    Limit Company        Segment
0   1       A1   47  BANGALORE      Gold  1500000      C1  Self Employed
1   2       A2   56   CALCUTTA    Silver   300000      C2   Salaried_MNC
2   3       A3   30     COCHIN  Platimum   540000      C3   Salaried_Pvt
3   4       A4   22     BOMBAY  Platimum   840084      C4           Govt
4   5       A5   59  BANGALORE  Platimum   420084      C5  Normal Salary

In [4]:
spend=pd.read_excel("C:/New folder/Credit Card Data.xlsx",sheet_name='Spend')

In [5]:
spend.head()

   Sl No: Customer      Month       Type         Amount
0       1       A1 2004-01-12  JEWELLERY  344054.980813
1       2       A1 2004-01-03      PETRO     935.495203
2       3       A1 2004-01-15    CLOTHES    8687.895474
3       4       A1 2004-01-25       FOOD     341.159711
4       5       A1 2005-01-17     CAMERA    3406.639477

In [6]:
repay_data=pd.read_excel("C:/New folder/Credit Card Data.xlsx",sheet_name='Repayment')

In [7]:
repay_data.head()

   SL No: Customer      Month        Amount
0       1       A1 2006-05-15  2.308473e+05
1       2       A1 2005-08-27  1.835124e+03
2       3       A1 2004-03-07  4.858701e+03
3       4       A1 2005-03-01  1.360527e+06
4       5       A1 2004-02-14  1.902322e+05

### Checking the data for any corrupt data, missing values, incorrect data types

In [8]:
master_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 8 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   No        100 non-null    int64
 1   Customer  100 non-null    object
 2   Age       100 non-null    int64
 3   City      100 non-null    object
 4   Product   100 non-null    object
 5   Limit     100 non-null    int64
 6   Company   100 non-null    object
 7   Segment   100 non-null    object
dtypes: int64(3), object(5)
memory usage: 6.4+ KB

In [10]:
master_data.shape

(100, 8)

In [ ]:
### There are no null values in master_data.

In [15]:
master_data.describe().T

,count,mean,std,min,25%,50%,75%,max
No,100.0,50.50,29.011492,1.0,25.75,50.5,75.25,100.0
Age,100.0,46.46,17.816925,14.0,30.00,47.5,62.25,75.0
Limit,100.0,710404.05,529828.971840,10000.0,442521.00,500000.0,1200000.00,3000000.0

In [16]:
master_data[master_data['Age']<18].shape

(3, 8)

In [ ]:
### There atre 3 rows where age is less than 18. let's replace it with mean age.

In [17]:
master_data.loc[(master_data.Age<18),'Age']=master_data.Age.mean()

In [18]:
master_data.describe().T

,count,mean,std,min,25%,50%,75%,max
No,100.0,50.5000,29.011492,1.0,25.75,50.5,75.25,100.0
Age,100.0,47.3938,16.946251,18.0,33.00,47.5,62.25,75.0
Limit,100.0,710404.0500,529828.971840,10000.0,442521.00,500000.0,1200000.00,3000000.0

In [ ]:
### data types looks alright for master_data.

In [20]:
spend.shape

(1500, 5)

In [21]:
spend.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1500 entries, 0 to 1499
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Sl No:    1500 non-null   int64
 1   Customer  1500 non-null   object
 2   Month     1500 non-null   datetime64[ns]
 3   Type      1500 non-null   object
 4   Amount    1500 non-null   float64
dtypes: datetime64[ns](1), float64(1), int64(1), object(2)
memory usage: 58.7+ KB

In [22]:
spend.isnull().sum()

Sl No:      0
Customer    0
Month       0
Type        0
Amount      0
dtype: int64

In [ ]:
## There are no null values in spend dataset and datatypes are correct for all varibales.

In [24]:
repay_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 807 entries, 0 to 806
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   SL No:    807 non-null    int64
 1   Customer  807 non-null    object
 2   Month     803 non-null    datetime64[ns]
 3   Amount    807 non-null    float64
dtypes: datetime64[ns](1), float64(1), int64(1), object(1)
memory usage: 25.3+ KB

In [25]:
repay_data.shape

(807, 4)

In [26]:
repay_data.isnull().sum()

SL No:      0
Customer    0
Month       4
Amount      0
dtype: int64

In [ ]:
## There are 4 missing values in month variable in repayment dataset.

## Answer the following questions:
- How many unique customers are there?
- How many spend categories are there?
- Which category has the highest average spend?
- What is the average monthly spent by product categories?
- Which customers are reaching 90% or more of their spending limit?
- Which city has the maximum number of spenders, each month? Is there a need to run campaigns in specific cities?
- Which age group spends the most?

In [28]:
## How many unique customers are there?

master_data['Customer'].nunique()

100

There are 100 unique customers.

In [30]:
## How many spend categories are there?

spend['Type'].nunique()

15

There are 15 spend categories.

In [35]:
## Which category has the highest average spend?

avg_spend=spend.groupby('Type')['Amount'].mean().to_frame()

In [38]:
avg_spend.sort_values('Amount',ascending=False)

                     Amount
Type
CAR           409143.467018
AIR TICKET    254632.194082
JEWELLERY     239218.687225
BIKE          210701.269489
AUTO           27320.763977
CLOTHES        25140.160688
CAMERA         21499.802175
RENTAL         13106.511138
BUS TICKET     12681.030717
SHOPPING        7394.332039
SANDALS         2516.628761
MOVIE TICKET    1875.298919
TRAIN TICKET    1627.490364
PETRO            549.483953
FOOD             341.168321

Car has the highest average spend of 409143.4.

In [ ]:
## What is the average monthly spent by product categories?

In [39]:
master_data.head()

   No Customer   Age       City   Product    Limit Company        Segment
0   1       A1  47.0  BANGALORE      Gold  1500000      C1  Self Employed
1   2       A2  56.0   CALCUTTA    Silver   300000      C2   Salaried_MNC
2   3       A3  30.0     COCHIN  Platimum   540000      C3   Salaried_Pvt
3   4       A4  22.0     BOMBAY  Platimum   840084      C4           Govt
4   5       A5  59.0  BANGALORE  Platimum   420084      C5  Normal Salary

In [41]:
master_data['Product'].unique()

array(['Gold', 'Silver', 'Platimum'], dtype=object)

In [40]:
spend.head()

   Sl No: Customer      Month       Type         Amount
0       1       A1 2004-01-12  JEWELLERY  344054.980813
1       2       A1 2004-01-03      PETRO     935.495203
2       3       A1 2004-01-15    CLOTHES    8687.895474
3       4       A1 2004-01-25       FOOD     341.159711
4       5       A1 2005-01-17     CAMERA    3406.639477

The average spend on JEWELLERY is 239218.687225.

In [ ]:
## Which customers are reaching 90% or more of their spending limit?

In [44]:
customer_total_spend=spend.groupby('Customer')['Amount'].sum().to_frame()

In [51]:
customer_total_spend.reset_index(inplace=True)

In [53]:
customer_total_spend = customer_total_spend.rename(columns={'Amount': 'Total_spend'})

In [54]:
merged_data=pd.merge(master_data,customer_total_spend,on='Customer',how='left')

In [55]:
merged_data.head()

,No,Customer,Age,City,Product,Limit,Company,Segment,Total_spend
0,1,A1,47.0,BANGALORE,Gold,1500000,C1,Self Employed,2.202653e+06
1,2,A2,56.0,CALCUTTA,Silver,300000,C2,Salaried_MNC,1.754633e+05
2,3,A3,30.0,COCHIN,Platimum,540000,C3,Salaried_Pvt,5.334431e+05
3,4,A4,22.0,BOMBAY,Platimum,840084,C4,Govt,9.046601e+05
4,5,A5,59.0,BANGALORE,Platimum,420084,C5,Normal Salary,9.235348e+05

In [59]:
merged_data[merged_data['Total_spend']>((merged_data['Limit']*90)/100)].shape

(60, 9)

In [ ]:
## There are 60 people who have spend more than 90% of their spending capacity.

In [ ]:
##Which city has the maximum number of spenders, each month? Is there a need to run campaigns in specific cities?

In [60]:
master_data.head()

   No Customer   Age       City   Product    Limit Company        Segment
0   1       A1  47.0  BANGALORE      Gold  1500000      C1  Self Employed
1   2       A2  56.0   CALCUTTA    Silver   300000      C2   Salaried_MNC
2   3       A3  30.0     COCHIN  Platimum   540000      C3   Salaried_Pvt
3   4       A4  22.0     BOMBAY  Platimum   840084      C4           Govt
4   5       A5  59.0  BANGALORE  Platimum   420084      C5  Normal Salary

In [61]:
spend.head()

   Sl No: Customer      Month       Type         Amount
0       1       A1 2004-01-12  JEWELLERY  344054.980813
1       2       A1 2004-01-03      PETRO     935.495203
2       3       A1 2004-01-15    CLOTHES    8687.895474
3       4       A1 2004-01-25       FOOD     341.159711
4       5       A1 2005-01-17     CAMERA    3406.639477

In [ ]:
## Which age group spends the most?

In [62]:
merged_data.head()

,No,Customer,Age,City,Product,Limit,Company,Segment,Total_spend
0,1,A1,47.0,BANGALORE,Gold,1500000,C1,Self Employed,2.202653e+06
1,2,A2,56.0,CALCUTTA,Silver,300000,C2,Salaried_MNC,1.754633e+05
2,3,A3,30.0,COCHIN,Platimum,540000,C3,Salaried_Pvt,5.334431e+05
3,4,A4,22.0,BOMBAY,Platimum,840084,C4,Govt,9.046601e+05
4,5,A5,59.0,BANGALORE,Platimum,420084,C5,Normal Salary,9.235348e+05